[
    {
      "Date": "10-1932",
      "English": "Father Hugh Sharkey recalled from Chekiang, China, to found a mission for the Chinese people of Vancouver.",
      "Chinese": "斯加波羅外方傳教會之 Hugh Sharkey 神父由我國浙江省奉召到溫哥華創辦一華人堂區。",
      "photos":[]
    },
    {
      "Date": "12-1933",
      "English": "Mission officially opened with Mass offered by Archbishop William Mark Duke in the small house.",
      "Chinese": "堂區正式開幕，由William Mark Duke 總主教舉行第一台彌撒聖祭。",
      "photos":[]
    },
    {
      "Date": "12-1933",
      "English": "Formal opening of the Mission's Kindergarten. Rose Mary Wong was the first student to register.",
      "Chinese": "堂區附設之幼稚園成立並開始招收學生，第一個報名之學生爲Rose Mary Wong。",
      "photos":[]
    },
    {
      "Date": "09-1934",
      "English": "First group baptized. Thirteen in all.",
      "Chinese": "第一次集體領冼，人數為十三人。",
      "photos":[]
    },
    {
      "Date": "09-1938",
      "English": "Sister Hilda (Principal), Sister Mary Philip and Sister Francis Regis arrived to staff the St. Francis Xavier School. The initial enrollment for this unique school was 55.",
      "Chinese": "Hilda (後被委為校長), Mary Philip 與 Francis 和 Riges修女抵達堂區協助小學事宜。首期學生為五十五人。",
      "photos":["19380903.png"]
    },
    {
      "Date": "08-1939",
      "English": "The building on E. Georgia that was purchased in 1938 by Father Turner was moved to the lot behind the convent. After renovation, it became our Chapel.",
      "Chinese": "於 1938 年購下位於 ( E. Georgia)  佐冶東街之物業，其上蓋被移往修女宿舍後之空地， 於裝修後， 成爲堂區之新聖堂。",
      "photos":[]
    },
    {
      "Date": "10-1963",
      "English": "Father Chow established the parish Council. ",
      "Chinese": "周神父成立本堂諮議會。",
      "photos":[]
    },
    {
      "Date": "12-1964",
      "English": "The Christmas Midnight Mass was offered for the first time in Chinese.",
      "Chinese": "首次以中文舉行子夜彌撒。",
      "photos":[]
    },
    {
      "Date": "01-1969",
      "English": "Father Chow organized a club for elderly ladies - the Blessed Sacrament Club. One of their main work was to take care of the altar linens and the Church.",
      "Chinese": "周神父為年長婦女教友粗織一名爲聖體會之善會，主要任務之一為負責祭台布與清理聖堂。",
      "photos":["196901.png"]
    },
    {
      "Date": "01-1975",
      "English": "Departure Day for a dearly beloved Pastor, Father Chow. The 9:30am Mass was crowded to the doors and beyond. Fathers Aloysius Lou, the incoming Pastor and Father Chafe S.F.M., the previous Pastor were the Co-celebrants with the out-going Pastor at the\nHigh Mass, Father Chow's final Mass as Pastor of St. Francis. After the final blessing, Father A. Lou handed him the Keys of St. Francis Xavier Parish.\nImmediately following the morning Mass, Father Chow left for the airport. He was not alone - a great throng of parishioners followed him and remained at the airport until the plane carrying Father Chow, was out of sight.\nFather Aloysius Lou became our Pastor today - the second Chinese Pastor of St. Francis Xavier Parish.",
      "Chinese": "周神父以本堂神父身份作最後一台彌撒，並由前任本堂神父Chafe 與即將接任之盧神父襄祭，到場教友甚為擠擁，最後周神父降褔盧神父並將聖堂鎖匙交與盧神父。彌撒後隨即前往機場，全體敎友尾隨而至，均面露依依不捨之情，待神父乘搭之飛機遠去方各自回家。盧湛明神父正式上任爲本堂神父。",
      "photos":[]
    },
    {
      "Date": "09-1979",
      "English": "As a community, St. Francis Xavier Parish sponsored 30 vietnamese refugees to resettle in Canada.",
      "Chinese": "聖堂以團體名義向政府担保卅名越南教友來加定居。",
      "photos":[]
    },
    {
      "Date": "05-1981",
      "English": "Another first - A Walkathon.\nWhat began as a plan to raise funds for school supplies turned out to be a happy full-blown-parish affair. Parents, friends and their friends joined the school-children on the five-mile walk around Stanley Park.",
      "Chinese": "為學校籌款而舉辦之百萬行第一次舉行。沿士丹尼公園海邊而行，路程約為五哩。",
      "photos":[]
    },
    {
      "Date": "07-2019",
      "English": "Vietnamese immigrants of St. Francis Xavier Families celebrate 40th Anniversary with Mass and Dinner.",
      "Chinese": "越南方濟之家40週年感恩彌撒及晚會。",
      "photos":[]
  },
  {
      "Date": "11-2019",
      "English": "Parish hosts \"\"The Bible, Salvation History\"\" Presentation by Grace Lee.",
      "Chinese": "聖方濟堂舉辦了「聖經：我們的救恩史」講座。",
      "photos":[]
  },
  {
      "Date": "03-2020",
      "English": "Archdiocese of Vancouver announced that all Masses and parish activities be suspended.",
      "Chinese": "溫哥華教區指示，所有彌撒及堂區活動取消。",
      "photos":[]
  },
  {
      "Date": "03-2020",
      "English": "Parish started to have online virtual Mass.",
      "Chinese": "堂區開始現場直播主日感恩祭。",
      "photos":[]
  },
  {
      "Date": "05-2020",
      "English": "Resuming Public Mass with an upper limit of 50 attendances.",
      "Chinese": "恢復公開彌撒，人數上限為50。",
      "photos":[]
  },
  {
      "Date": "04-2021",
      "English": "Easter Sunday Parish celebrated 5 Masses in open School playground.",
      "Chinese": "復活節主日－堂區在學校操場舉行5 台戶外彌撒。",
      "photos":[]
  },
  {
      "Date": "07-2021",
      "English": "Parish resumed all Masses.",
      "Chinese": "堂區恢復所有彌撒。",
      "photos":[]
  },
  {
      "Date": "08-2021",
      "English": "\"\"Welcome home to S.F.X. Let us celebrate Our Blessed Mother!\"\" event Archbishop Michael Miller, CSB celebrated mass to welcome parishioners returning to the parish. After mass, parishioners have a reunion with their friends and a greeting with the new immigrants in the \"\"Night Market\"\" event organized by parish sodalities.",
      "Chinese": "「與聖母同在，聖方濟大家庭與你重聚」總主教 Michael Miller 舉行彌撒，歡迎教友重返教堂。彌撒結束後，教友與朋友重聚，並與新移民教友參加了堂區善會舉辦的「夜市」活動。",
      "photos":[]
  },
  {
      "Date": "05-2022",
      "English": "Fr. Aloysius Lou at the age of eighty-eight, passed away peacefully in the comfort of his home, on May 20, 2022.",
      "Chinese": "盧湛明神父於五月二十日蒙主寵召，安詳返回主的懷抱，享年八十八歲。",
      "photos":[]
  },
  {
      "Date": "12-2022",
      "English": "Archbishop Michael Miller, CSB blessed the 12 Apostles Stained Glass.",
      "Chinese": "總主教 Michael Miller 祝聖十二宗徒彩繪玻璃。",
      "photos":[]
  },
  {
      "Date": "02-2023",
      "English": "Feast Day of Our Lady of Lourdes - Anointing of the Sick Mass & Senior Luncheon.",
      "Chinese": "露德聖母瞻禮日病人傅油彌撒及長者聯歡午宴。",
      "photos":[]
  },
  {
      "Date": "03-2023",
      "English": "Lenten Taizé Prayer with Children and their families.",
      "Chinese": "四旬期泰澤祈禱，與孩子及家人一起以歌聲頌讚天主。",
      "photos":[]
  },
  {
      "Date": "05-2023",
      "English": "Archbishop Michael Miller, CSB celebrated Marriage Anniversary Mass Archdiocese event.",
      "Chinese": "總主教 Michael Miller 舉行結婚週年紀\n念彌撒的教區活動。",
      "photos":[]
  },
  {
      "Date": "06-2023",
      "English": "Cursillo in Christianity.",
      "Chinese": "基督活力運動。",
      "photos":[]
  },
  {
      "Date": "06-2023",
      "English": "Congregation of St. John the Baptist celebrated the 95th Anniversary and Fr. Joseph Ly and Fr. Dominic Hoang celebrated the 20th Anniversary of ordination to the Priesthood. Thanksgiving Mass & dinner.",
      "Chinese": "耀漢小兄弟會慶祝九十五週年暨李志雄神父及黃公宇神父晉鐸二十週年感恩聖祭及聚餐。",
      "photos":[]
  },
  {
      "Date": "07-2023",
      "English": "Fr. Joseph Ly and Sr. Teresa Gou led 12 youths to World Youth Day in Portugal.",
      "Chinese": "李志雄神父和敬雅潔修女率領12名青年參加葡萄牙舉行的世界青年節。",
      "photos":[]
  },
  {
      "Date": "09-2023",
      "English": "Priests from the Little Brothers of St. John the Baptist Congregation, serving in Taiwan, Vietnam, and the United States, visited St. Francis Xavier Parish.",
      "Chinese": "在台灣，越南和美國服務的7位耀漢小兄弟會神父訪問聖方濟堂。",
      "photos":[]
  },
  {
      "Date": "09-2023",
      "English": "Sr. Maria Ko Bible Talks.",
      "Chinese": "高夏芳修女實體聖經講座。",
      "photos":[]
  },
  {
      "Date": "10-2023",
      "English": "Rosary Musical Prayer - All choirs from St. Francis Xavier Parish hosted a special joint musical prayer session for all parishioners.",
      "Chinese": "玫瑰月祈禱音樂會－堂區所有聖歌詠團聯合舉行一個別開生面的祈禱音樂會。",
      "photos":[]
  },
  {
      "Date": "11-2023",
      "English": "Extended an honourable invitation to Archbishop Savio Tai Fai Hon, SDB to join us in the St. Francis Xavier Parish's 90th Anniversary celebration.",
      "Chinese": "榮幸誠邀到韓大輝總主教蒞臨與我們一起慶祝聖方濟堂建堂九十週年。",
      "photos":[]
  },
  {
      "Date": "12-2023",
      "English": "Extended an honourable invitation to Archbishop Michael Miller and Archbishop Savio Tai Fai Hon to celebrate the 90th Anniversary of St. Francis Xavier Parish and the 15th Anniversary of Dedication of Our New Church Celebration Thanksgiving Mass & Gala Dinner.",
      "Chinese": "榮幸誠邀到總主教 Michael Miller 及韓大輝總主教慶祝聖方濟堂成立九十週年暨祝聖新聖堂十五週年主保瞻禮感恩彌撒及晚宴。",
      "photos":[]
  }
   ]